---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IFCData Properties
IFCData Class See Also Send Feedback
---

The IFCData type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | HasValue | Identifies if the data is empty or contains a value. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | PrimitiveType | The primitive data type. |

# See Also

IFCData Class

Autodesk.Revit.DB.IFC Namespace